let dataCards=[
    {
        id:1,
        name:'PHP',
        type:'BackEnd',
        title:'Personal Home Page Tools — скриптова мова програмування, ' +
            'була створена для генерації HTML-сторінок на стороні вебсервера. ' +
            'PHP є однією з найпоширеніших мов, що використовуються у сфері веброзробок. ' +
            'PHP підтримується переважною більшістю хостинг-провайдерів.',
        img:require('../assets/dataCardsLang/php.png'),
        description:' PHP: гіпертекстовий препроцесор), попередня назва: Personal Home Page Tools — скриптова мова програмування, ' +
            'була створена для генерації HTML-сторінок на стороні вебсервера. PHP є однією з найпоширеніших мов, що використовуються у сфері веброзробок ' +
            '(разом із Java, .NET, JavaScript, Python, Ruby). ' +
            'PHP підтримується переважною більшістю хостинг-провайдерів. PHP — проєкт відкритого програмного забезпечення.\n' +
            '\n' +
            'PHP інтерпретується вебсервером у HTML-код, який передається на сторону клієнта. На відміну від скриптової мови JavaScript, користувач ' +
            'не бачить PHP-коду, тому що браузер отримує готовий html-код. Це є перевагою з точки зору безпеки, але погіршує інтерактивність сторінок.' +
            ' Але ніхто не забороняє використовувати PHP для генерування JavaScript-кодів, які виконуються вже на стороні клієнта.'
    },
    {
        id:2,
        name:'C#',
        type:'BackEnd',
        title:'об\'єктно-орієнтована мова програмування з безпечною системою типізації для платформи ' +
            '.NET. Розроблена Андерсом Гейлсбергом, Скотом Вілтамутом та Пітером Гольде' +
            ' під егідою Microsoft Research (належить Microsoft).',
        img:require('../assets/dataCardsLang/c.png'),
        description:' C# (вимовляється Сі-шарп) — об\'єктно-орієнтована мова програмування з безпечною системою типізації для платформи .' +
            'NET. Розроблена Андерсом Гейлсбергом, Скотом Вілтамутом та Пітером Гольде під егідою Microsoft Research (належить Microsoft).Синтаксис ' +
            'C# близький до С++ і Java. ' +
            'Мова має строгу статичну типізацію, підтримує поліморфізм, перевантаження операторів, вказівники на функції-члени класів, атрибути,' +
            ' події, властивості, винятки, коментарі у форматі XML. Перейнявши багато від своїх попередників — мов С++, Object Pascal, Модула і ' +
            'Smalltalk — С#, спираючись на практику їхнього використання, виключає деякі моделі, що зарекомендували себе як проблематичні ' +
            'при розробці програмних систем, наприклад, мова С#, на відміну від C++, не передбачає множинне успадкування класів.Станом на вересень ' +
            '2023 року поточна стабільна версія мови C# 11.0, яка була випущена в 2022 році як частина платформи .NET 7.0.'
    },
    {
        id:3,
        name:'Perl',
        type:'BackEnd',
        title:' практична мова витягів та звітів) — високорівнева, інтерпретована, динамічна мова програмування ' +
            'загального призначення. Perl було розроблено у 1987 році Ларі Воллом, лінгвістом і програмістом ' +
            'за освітою, який у той час працював системним адміністратором у NASA, як скриптова мова для Unix, ' +
            'метою якої було полегшити процес обробки текстів файлів журналів.',
        img:require('../assets/dataCardsLang/Perl.png'),
        description:'Perl (неофіційна[4] розшифровка англ. Practical Extraction and Reporting Language — практична мова витягів та звітів) ' +
            '— високорівнева, інтерпретована, динамічна мова програмування загального призначення. Perl було розроблено у 1987 році Ларі Воллом, ' +
            'лінгвістом і програмістом за освітою, який у той час працював системним адміністратором у NASA, як скриптова мова для Unix, ' +
            'метою якої було полегшити процес обробки текстів файлів журналів[6][7]. З того часу до мови було внесено багато змін, і ' +
            'здійснено перегляд її концепції та архітектури, в результаті чого вона стала дуже популярною серед програмістів. Ларі Волл ' +
            'продовжує працювати над ядром мови, і наразі очікується вихід нової версії, Perl 6.Perl запозичує можливості багатьох інших мов ' +
            'програмування, як то C, shell scripting, AWK та sed[8]. Мова надає потужні можливості для обробки тексту без довільних обмежень на' +
            ' довжину даних багатьох сучасних інструментів Unix[9]. полегшує маніпуляції з текстовими файлами. Застосовується для програмування ' +
            'графіки, системного адміністрування, у мережному програмуванні, для програмного забезпечення, яке взаємодіє з базами даних, у ' +
            'програмуванні CGI для веб. Perl за свою гнучкість і потужність отримав прізвисько «швейцарського армійського ножа мов ' +
            'програмування.'

    },
    {
        id:4,
        name:'Asp.Net',
        type:'BackEnd',
        title:' технологія створення вебзастосунків і вебсервісів від компанії Майкрософт.' +
            ' Вона є складовою частиною платформи Microsoft.NET і розвитком старішої технології ' +
            'Microsoft ASP. На цей час останньою версією цієї технології є ASP.NET Core 6.0',
        img:require('../assets/dataCardsLang/asp.png'),
        description:'ASP.NET — технологія створення вебзастосунків і вебсервісів від компанії Майкрософт.' +
            ' Вона є складовою частиною платформи Microsoft.NET і розвитком старішої технології Microsoft ASP. На цей час останньою версією ' +
            'цієї технології є ASP.NET Core 6.0ASP.NET зовні багато в чому зберігає схожість із старішою технологією ASP, що дає змогу ' +
            'розробникам відносно легко перейти на ASP.NET. У той же час внутрішній устрій ASP.NET істотно відрізняється від ASP, оскільки ' +
            'вона заснована на платформі. NET і, отже, використовує всі нові можливості, що надаються цією платформою.'

    },
    {
        id:5,
        name:'Python',
        type:'BackEnd',
        title:' інтерпретована об\'єктно-орієнтована мова програмування високого рівня' +
            ' із суворою динамічною типізацією. Розроблена в 1990 році Гвідо ван Россумом. ' +
            'Структури даних високого рівня разом із динамічною семантикою та динамічним зв\'язуванням роблять її привабливою' +
            ' для швидкої розробки програм, а також як засіб поєднування наявних компонентів. ' +
            'Python підтримує модулі та пакети модулів, що сприяє модульності та повторному використанню коду.',
        img:require('../assets/dataCardsLang/python.png'),
        description:'Python  — інтерпретована об\'єктно-орієнтована мова програмування високого рівня із суворою динамічною типізацією' +
            '. Розроблена в 1990 році Гвідо ван Россумом. Структури даних високого рівня разом із динамічною семантикою' +
            ' та динамічним зв\'язуванням роблять її привабливою для швидкої розробки програм, а також як засіб поєднування наявних компонентів. ' +
            'Python підтримує модулі та пакети модулів, що сприяє модульності та повторному використанню коду. ' +
            'Інтерпретатор Python та стандартні бібліотеки доступні як у скомпільованій, так і у вихідній формі на всіх основних платформах. ' +
            'В мові програмування Python підтримується кілька парадигм програмування, зокрема: об\'єктно-орієнтована, процедурна, ' +
            'аспектно-орієнтована та функціональна.'

    },
    {
        id:6,
        name:'Java',
        type:'BackEnd',
        title:' об\'єктно-орієнтована мова програмування, випущена 1995 року компанією «Sun Microsystems»' +
            ' як основний компонент платформи Java. З 2009 року мовою займається компанія «Oracle»,' +
            ' яка того року придбала «Sun Microsystems». ' +
            'В офіційній реалізації Java-програми компілюються у байт-код, який при виконанні інтерпретується' +
            ' віртуальною машиною для конкретної платформи.',
        img:require('../assets/dataCardsLang/java.png'),
        description:'Java  — об\'єктно-орієнтована мова програмування, випущена 1995 року компанією «Sun Microsystems» як основний компонент ' +
            'платформи Java. З 2009 року мовою займається компанія «Oracle», яка того року придбала «Sun Microsystems». ' +
            'В офіційній реалізації Java-програми компілюються у байт-код, який при виконанні інтерпретується віртуальною машиною' +
            ' для конкретної платформи.«Oracle» надає компілятор Java та віртуальну машину Java, які задовольняють специфікації Java Community Process' +
            ', під ліцензією GNU General Public License.Мова значно запозичила синтаксис із C і C++. ' +
            'Зокрема, взято за основу об\'єктну модель С++, проте її модифіковано. Усунуто можливість появи деяких конфліктних ситуацій,' +
            ' що могли виникнути через помилки програміста та полегшено сам процес розроблення об\'єктно-орієнтованих програм. Ряд дій, які в С/C++' +
            ' повинні здійснювати програмісти, доручено віртуальній машині. Передусім Java розроблялась як платформо-незалежна мова, тому вона ' +
            'має менше низькорівневих можливостей для роботи з апаратним забезпеченням, що в порівнянні, наприклад, з C++ зменшує швидкість роботи ' +
            'програм. За необхідності таких дій Java дозволяє викликати підпрограми, написані іншими мовами програмування.Java вплинула на розвиток ' +
            'J++[en], що розроблялась компанією «Microsoft». Роботу над J++ було зупинено через судовий позов «Sun Microsystems», оскільки ця ' +
            'мова програмування була модифікацією Java. Пізніше в новій платформі «Microsoft» .NET випустили J#, щоб полегшити міграцію програмістів' +
            ' J++ або Java на нову платформу. З часом нова мова програмування С# стала основною мовою платформи, перейнявши багато чого з Java. J# ' +
            'востаннє включався в версію Microsoft Visual Studio 2005. Мова сценаріїв JavaScript має схожу із Java назву і синтаксис, але не' +
            ' пов\'язана із Java.'

    },
    {
        id:7,
        name:'Node.js',
        type:'BackEnd',
        title:' платформа з відкритим кодом для виконання високопродуктивних мережевих застосунків, ' +
            'написаних мовою JavaScript. Засновником платформи є Раян Дал (Ryan Dahl). ' +
            'Якщо раніше JavaScript застосовувався для обробки даних в браузері користувача, то node.js надав можливість' +
            ' виконувати JavaScript-скрипти на сервері та відправляти користувачеві результат їхнього виконання. ' +
            'Платформа Node.js перетворила JavaScript на мову загального використання з великою спільнотою розробників.',
        img:require('../assets/dataCardsLang/node.png'),
        description:'Node.js — платформа з відкритим кодом для виконання високопродуктивних мережевих застосунків, ' +
            'написаних мовою JavaScript. Засновником платформи є Раян Дал (Ryan Dahl). ' +
            'Якщо раніше JavaScript застосовувався для обробки даних в браузері користувача, то node.js надав можливість виконувати' +
            'JavaScript-скрипти на сервері та відправляти користувачеві результат їхнього виконання. Платформа Node.js перетворила' +
            ' JavaScript на мову загального використання з великою спільнотою розробників.Node.js має наступні властивості:асинхронна ' +
            'однониткова модель виконання запитів;неблокуючий ввід/вивід;система модулів CommonJS;рушій JavaScript Google V8;Для керування ' +
            'модулями використовується пакетний менеджер npm (node package manager).'

    },

    {
        id:8,
        name:'SQL',
        type:'BackEnd',
        title:' це діалогова мова програмування для здійснення запиту' +
            ' і внесення змін до бази даних, а також керування базами даних. ' +
            'Багато баз даних підтримує SQL з розширеннями до стандартної мови. Ядро SQL формує командна мова, ' +
            'яка дозволяє здійснювати пошук, вставку, оновлення і вилучення даних за допомогою використання системи керування ' +
            'і адміністративних функцій. SQL також включає CLI ' +
            '(Call Level Interface) для доступу і керування базами даних дистанційно.',
        img:require('../assets/dataCardsLang/sql.png'),
        description:'SQL  — мова структурованих запитів)' +
            ' — декларативна мова програмування для взаємодії користувача з базами даних, що застосовується для формування запитів,' +
            ' оновлення і керування реляційними БД, створення схеми бази даних та її модифікації, системи контролю за доступом до бази даних. ' +
            'Сама по собі SQL не є ані системою керування базами даних, ані окремим програмним продуктом. На відміну від дійсних мов програмування' +
            ' (C або Pascal), SQL може формувати інтерактивні запити або, бувши вбудованою в прикладні програми, виступати як інструкції для ' +
            'керування даними. Окрім цього, стандарт SQL містить функції для визначення зміни, перевірки та захисту даних.SQL — це діалогова мова' +
            ' програмування для здійснення запиту і внесення змін до бази даних, а також керування базами даних. Багато баз даних підтримує SQL ' +
            'з розширеннями до стандартної мови. Ядро SQL формує командна мова, яка дозволяє здійснювати пошук, вставку, оновлення і вилучення даних ' +
            'за допомогою використання системи керування і адміністративних функцій. SQL також включає CLI (Call Level Interface) для доступу і ' +
            'керування базами даних дистанційно.Основу бази даних SQL Server утворює сервер або ядро бази даних.[джерело?] Ядро бази даних відповідає ' +
            'за обробку запитів, які надходять від клієнтів, і передачу відповідних результатів клієнтським компонентам.[джерело?]Перша версія SQL ' +
            'була розроблена на початку 1970-х років у IBM. Ця версія мала назву SEQUEL і була призначена для обробки та пошуку даних, що містилися ' +
            'в реляційній базі даних IBM, System R. Мова SQL надалі була стандартизована Американськими Держстандартами (ANSI) в 1986. На початку SQL ' +
            'була запланована як мова запитів і управління даними, а пізніші модифікації SQL створені продавцями системи управління базами даних, які ' +
            'додали процедурні конструкції, control-of-flow команд і темпоральні розширення мов. З випуском стандарту SQL:1999 такі розширення були ' +
            'формально запозичені як частина мови SQL через Persistent Stored Modules (SQL/PSM).Критика SQL включає відсутність крос-платформенності, ' +
            'невідповідну обробку відсутніх даних (дивіться Null (SQL)). Часто це неоднозначна граматика і семантика мови.'

    },
    {
        id:9,
        name:'Rust',
        type:'BackEnd',
        title:' сучасна багатопарадигмова мова програмування загального призначення.' +
            ' Мова має сильну (строгу) типізацію і зосереджена на безпечній роботі з пам\'яттю ' +
            'та забезпеченні високої рівночасности виконання задач (можливість породжувати тисячі й навіть мільйони підпроцесів).' +
            'Початковий код проєкту поширюється під ліцензією MIT.',
        img:require('../assets/dataCardsLang/rust.png'),
        description:'Rust  — сучасна багатопарадигмова' +
            ' мова програмування загального призначення. Мова має сильну (строгу) типізацію і' +
            ' зосереджена на безпечній роботі з пам\'яттю та забезпеченні високої рівночасности виконання ' +
            'задач (можливість породжувати тисячі й навіть мільйони підпроцесів).' +
            'Початковий код проєкту поширюється під ліцензією MIT.Робота над мовою була розпочата працівником Mozilla Ґрейдоном Гоаром ' +
            '2006 року як особистий проєкт. 2009 до розроблення підключилася Mozilla, а 2010 року мова була офіційно представлена на Mozilla Summit 2010.' +
            'З 2021, після скорочень у Mozilla, розроблення здійснює окремий фонд Rust Foundation[5]. Мову названо за назвою родини грибів іржа.' +
            ' 2010 року розроблення мови було переведено з попередньої версії компілятора, яка була написана мовою OCaml, на компілятор,' +
            'який написаний безпосередньо на Rust, з використанням LLVM як бекенду. 2011 року новий компілятор успішно скомпілював сам себе.'

    },
    {
        id:10,
        name:'Javascript',
        type:'FrontEnd',
        title:'  динамічна, об\'єктно-орієнтована прототипна мова програмування. ' +
            'Реалізація стандарту ECMAScript. Найчастіше використовується для створення сценаріїв вебсторінок,' +
            ' що надає можливість на боці клієнта (пристрої кінцевого користувача) взаємодіяти з користувачем,' +
            ' керувати браузером, асинхронно обмінюватися даними з сервером, змінювати структуру та зовнішній вигляд ' +
            'вебсторінки.',
        img:require('../assets/dataCardsLang/javascript.png'),
        description:'JavaScript (JS) — динамічна, об\'єктно-орієнтована прототипна мова програмування. ' +
            'Реалізація стандарту ECMAScript. Найчастіше використовується для створення сценаріїв вебсторінок,' +
            ' що надає можливість на боці клієнта (пристрої кінцевого користувача) взаємодіяти з користувачем, керувати браузером, ' +
            'асинхронно обмінюватися даними з сервером, змінювати структуру та зовнішній вигляд вебсторінки.JavaScript класифікують як ' +
            'прототипну (підмножина об\'єктно-орієнтованої), скриптову мову програмування з динамічною типізацією. ' +
            'Окрім прототипної, JavaScript також частково підтримує інші парадигми програмування (імперативну та частково' +
            ' функціональну) і деякі відповідні архітектурні властивості, зокрема: динамічна та слабка типізація, автоматичне' +
            ' керування пам\'яттю, прототипне наслідування, функції як об\'єкти першого класу.'

    },
    {
        id:11,
        name:'Swift',
        type:'FullStack',
        title:'  багатопарадигмова компільована мова програмування, ' +
            'розроблена компанією Apple для того, щоб співіснувати з Objective C і бути стійкішою до помилкового коду.' +
            ' Swift була представлена на конференції розробників WWDC 2014[1].' +
            ' Мова побудована з LLVM компілятором, включеного у Xcode 6 beta.',
        img:require('../assets/dataCardsLang/swift.png'),
        description:'Мова Swift – це нова мова програмування для розробки додатків для iOS, macOS, watchOS, та tvOS.' +
            ' Проте багато частин Swift будуть знайомі з вашого досвіду розробки на мовах C та Objective-C.Мова Swift' +
            ' надає свої власні версії всіх фундаментальних типів C та Objective-C, включаючи Int для цілих чисел, Double ' +
            'та Float для значень з плаваючою комою, Bool для Булевих значень, та String для текстової інформації. Мова Swift ' +
            'також має потужні версії трьох основних типів колекцій: Array, Set, та Dictionary, як описано в розділі Колекції.Як і ' +
            'мова C, Swift використовує змінні для того, щоб зберігати значення та щоб посилатись на них по ідентифікатору. У мові ' +
            'Swift також широко використовуються змінні, чиє значення не може бути змінене. Їх називають константами,' +
            ' але вони набагато потужніші ніж константи в мові C. Константи вживаються всюди у Swift, щоб зробити код безпечнішим та' +
            ' більш зрозумілим у намірах, коли ви працюєте зі значеннями, котрим не потрібно змінюватись.Окрім знайомих типів,' +
            ' у мові Swift з’являються більш розвинені типи, котрих нема в Objective-C, наприклад, кортежі. Кортежі дозволяють ' +
            'створювати та передавати групи значень. За допомогою кортежу можна повернути одразу декілька значень з функції як ' +
            'єдине об’єднане значення.'

    },
    {
        id:12,
        name:'React',
        type:'FrontEnd',
        title:'  React дозволяє розробникам створювати великі вебзастосунки, які використовують дані,' +
            ' котрі змінюються з часом, без перезавантаження сторінки. Його мета полягає в тому, щоб бути швидким,' +
            ' простим, масштабованим. React обробляє тільки користувацький інтерфейс у застосунках. ' +
            'Це відповідає видові у шаблоні модель-вид-контролер (MVC), і може бути використане у поєднанні з іншими ' +
            'JavaScript бібліотеками або в великих фреймворках MVC, таких як AngularJS',
        img:require('../assets/dataCardsLang/react.png'),
        description:'React (старі назви: React.js, ReactJS) — відкрита JavaScript бібліотека для створення інтерфейсів користувача, ' +
            'яка покликана вирішувати проблеми часткового оновлення вмісту вебсторінки, з якими стикаються в розробці односторінкових ' +
            'застосунків. Розробляється Meta (раніше Facebook) і спільнотою індивідуальних розробників.[2][3][4]React дозволяє розробникам ' +
            'створювати великі вебзастосунки, які використовують дані, котрі змінюються з часом, без перезавантаження сторінки. Його мета полягає' +
            ' в тому, щоб бути швидким, простим, масштабованим. React обробляє тільки користувацький інтерфейс у застосунках. Це відповідає видові' +
            ' у шаблоні модель-вид-контролер (MVC), і може бути використане у поєднанні з іншими JavaScript бібліотеками або в великих фреймворках ' +
            'MVC, таких як AngularJS[5]. Він також може бути використаний з React на основі надбудов, щоб піклуватися про частини без користувацького ' +
            'інтерфейсу побудови вебзастосунків. Як бібліотеку інтерфейсу користувача React найчастіше використовують разом з' +
            ' іншими бібліотеками, такими як Redux.' +
            'В даний час React використовують Khan Academy, Netflix, Yahoo, Airbnb, Sony, Atlassian та інші.'

    },
    {
        id:13,
        name:'Angular',
        type:'FrontEnd',
        title:'  В основі Angular лежить двостороннє зв’язування даних, що робить його унікальним і потужним інструментом. ' +
            'Це дає змогу синхронізувати дані між призначеним для користувача інтерфейсом і кодом, що робить додатки більш ' +
            'чуйними і дружніми для користувачів. Коли користувач взаємодіє з інтерфейсом, Angular автоматично оновлює дані ' +
            'в коді, а також назад – коли дані змінюються програмно, інтерфейс миттєво оновлюється. ' +
            'Таке миттєве оновлення даних робить процес розроблення ефективним і дає змогу створювати інтерактивні застосунки.',
        img:require('../assets/dataCardsLang/angular.png'),
        description:'Angular – це потужний і повноцінний фреймворк, розроблений командою з Google. Його головна мета – спростити створення складних веб-додатків і забезпечити структуровану розробку із застосуванням найкращих практик.\n' +
            '\n' +
            'В основі Angular лежить двостороннє зв’язування даних, що робить його унікальним і потужним інструментом. Це дає змогу синхронізувати дані між призначеним для користувача інтерфейсом і кодом, що робить додатки більш чуйними і дружніми для користувачів. Коли користувач взаємодіє з інтерфейсом, Angular автоматично оновлює дані в коді, а також назад – коли дані змінюються програмно, інтерфейс миттєво оновлюється. Таке миттєве оновлення даних робить процес розроблення ефективним і дає змогу створювати інтерактивні застосунки.\n' +
            '\n' +
            'Ще однією сильною стороною Angular є його компонентний підхід. Розробники створюють користувацькі елементи (компоненти) і об’єднують їх разом для створення складних інтерфейсів. Компоненти легко перевикористовувати в різних частинах додатка, що покращує читабельність коду і робить його більш підтримуваним.\n' +
            '\n' +
            'Angular надає безліч вбудованих інструментів і функцій для розробки, як-от маршрутизація, управління станом і HTTP-запити. Це робить його універсальним фреймворком для різних завдань і дає змогу розробникам фокусуватися на створенні функціональності, а не витрачати час на написання однотипних рішень.'

    },
    {
        id:14,
        name:'Vue',
        type:'FrontEnd',
        title:'  Vue.js – це сучасний JavaScript-фреймворк для розробки користувацьких інтерфейсів. ' +
            'Він надає зручні інструменти та можливості для створення інтерактивних веб-додатків.' +
            ' Однією з його головних переваг є легковажність і простота у використанні (навіть новачки в розробці ' +
            'веб-додатків швидко освоюють його основи завдяки інтуїтивному синтаксису і простому API). ' +
            'Водночас він має достатній функціонал для розробки складних проектів.',
        img:require('../assets/dataCardsLang/vue.png'),
        description:'Ви коли-небудь замислювалися, як створювати інтерактивні та елегантні користувацькі інтерфейси для ваших веб-додатків? ' +
            'Можливо, вам хотілося б мати потужний інструмент, який спрощує розробку фронтенду і забезпечує гладку роботу ваших додатків.' +
            ' І ось тут на сцену виходить Vue.js – це сучасний JavaScript-фреймворк для розробки користувацьких інтерфейсів. Він надає зручні ' +
            'інструменти та можливості для створення інтерактивних веб-додатків. Однією з його головних переваг є легковажність і простота у' +
            ' використанні (навіть новачки в розробці веб-додатків швидко освоюють його основи завдяки інтуїтивному синтаксису і простому API).' +
            ' Водночас він має достатній функціонал для розробки складних проектів.Vue.js пропонує інтуїтивний і гнучкий підхід до створення ' +
            'веб-додатків, дає змогу будувати та комбінувати компоненти інтерфейсу без складнощів. За допомогою Vue ви можете створювати динамічні' +
            ' та чуйні веб-додатки.'

    },
    {
        id:15,
        name:'Django',
        type:'FrontEnd',
        title:' високорівневий відкритий Python-фреймворк (програмний каркас) для розробки вебсистем. ' +
            'Названо його було на честь джазмена Джанго Рейнхардта (відповідно до музичних смаків одного ' +
            'зі засновників проєкту).Сайт на Django будується з однієї або декількох частин, які ' +
            'рекомендується робити модульними. Це одна з істотних архітектурних відмінностей цього фреймворку від деяких' +
            ' інших (наприклад Ruby on Rails).Архітектура Django подібна на «Модель-Вигляд-Контролер» (MVC). ',
        img:require('../assets/dataCardsLang/django.png'),
        description:'Django  - безкоштовний і відкритий фреймворк для створення веб додатків, написаний мовою ' +
            'програмування Python. Веб фреймворк - набір компонентів, які допомагають розробляти веб-сайти швидше і' +
            ' простіше.При побудові веб-сайту, ви завжди потребуєте схожого набору компонентів: спосіб управління авторизацією користувача ' +
            '(створення акаунту, вхід, вихід), панель управління, форми, спосіб завантажити файли, тощо.На щастя для вас інші люди вже давно' +
            ' помітили, що веб розробники зіштовхуються з подібними проблемами під час розробки нового сайту, отже вони об\'єднались в команду ' +
            'і створили фреймворки (Django є одним з таких), що дають вам вже готові до використання компоненти.Фреймворки існують для того, ' +
            'щоб вберегти вас від необхідності повторно винаходити велосипед і допомогти зменшити деякі накладні витрати під час розробки нового' +
            ' сайту.'

    },


]

export default dataCards;